БИТУправление_медицинским_центром_демо/src/Catalogs/ПереченьВредныхФакторовИРабот/ПереченьВредныхФакторовИРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПереченьВредныхФакторовИРабот</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ОбязательныеДействия29н</name>
      <description>Обязательные действия 29н</description>
    </items>
    <items>
      <name>ОбязательныеДействия302н</name>
      <description>Обязательные действия 302н</description>
    </items>
    <items>
      <name>ОбязательныеДействия342н</name>
      <description>Обязательные действия 342н</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеречняДляМедОсмотра</name>
    <type>
      <types>EnumRef.ВидыПеречняДляМедОсмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерППДляСортировки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрачиСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛабораторныеИФункциональныеИсследованияСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МедицинскиеПротивопоказанияСтрока</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МедицинскиеПротивопоказанияСтрокаДляЗагрузки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьОсмотров</name>
    <type>
      <types>CatalogRef.ПериодичностьОсмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>ВредноеВещество</name>
    <type>
      <types>CatalogRef.ВредныеВещества</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНомерППиПриказа_302н</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНомерПП_302н</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьНомерППДляСортировки_302н</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приказ</name>
    <type>
      <types>CatalogRef.ПриказыМедосмотров</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонОсмотраСправки</name>
    <type>
      <types>CatalogRef.ШаблоныHTML</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Врачи</name>
    <attributes>
      <name>Врач</name>
      <type>
        <types>CatalogRef.ДействияМедосмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоРекомендации</name>
      <comment>По показаниям врачей-специалистов</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипМедосмотра</name>
      <type>
        <types>EnumRef.ТипыМедосмотров</types>
      </type>
    </attributes>
    <attributes>
      <name>Ограничение</name>
      <type>
        <types>CatalogRef.ОграниченияДействийМедосмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриРасчетеЦены</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеТребуетОтметкиВыполнения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛабораторныеИФункциональныеИсследования</name>
    <attributes>
      <name>Исследование</name>
      <type>
        <types>CatalogRef.ДействияМедосмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоРекомендации</name>
      <comment>По показаниям врачей-специалистов</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипМедосмотра</name>
      <type>
        <types>EnumRef.ТипыМедосмотров</types>
      </type>
    </attributes>
    <attributes>
      <name>Ограничение</name>
      <type>
        <types>CatalogRef.ОграниченияДействийМедосмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриРасчетеЦены</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеТребуетОтметкиВыполнения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МедицинскиеПротивопоказания</name>
    <attributes>
      <name>Противопоказание</name>
      <type>
        <types>CatalogRef.МедицинскиеПротивопоказания</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипМедосмотра</name>
      <type>
        <types>EnumRef.ТипыМедосмотров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыВредныхВеществ</name>
    <attributes>
      <name>ГруппаВредныхВеществ</name>
      <type>
        <types>EnumRef.ГруппыОпасныхВеществ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/ПриказыМедосмотров/ПриказыМедосмотров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПриказыМедосмотров</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправкиИИныеМедосмотры</name>
      <description>Справки и иные медосмотры</description>
    </items>
    <items>
      <name>Приказ29н</name>
      <description>Приказ 29н</description>
    </items>
    <items>
      <name>Приказ302н</name>
      <description>Приказ 302н</description>
    </items>
    <items>
      <name>Приказ342н</name>
      <description>Приказ 342н</description>
    </items>
  </predefined>
  <attributes>
    <name>ФакторСОбязДействиями</name>
    <type>
      <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантГруппировкиГруппыЗаключения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.РегистрируемыеЭлектронныеМедДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСЭМД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МакетДляПодписанияЭЦП</name>
    <type>
      <types>CatalogRef.ВнешниеОбработки</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>МакетыПечати</name>
    <attributes>
      <name>Макет</name>
      <type>
        <types>CatalogRef.ВнешниеОбработки</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбластьПрименения</name>
      <type>
        <types>EnumRef.ОбластьПримененияПФДляМО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПоля</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>37</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмЗаполнения</name>
      <type>
        <types>CatalogRef.ВычисляемыеЗначенияПараметров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиПодписей</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.РолиПриПодписиМедДокументов</types>
        <types>EnumRef.РолиПодписей</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РежимНастройкиДоступности</name>
      <type>
        <types>EnumRef.РежимыНастройкиДоступностиРоли</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакДоступностиРоли</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторРоли</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/ПереченьВредныхФакторовИРабот/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВредныйФакторСправки") И Параметры.ВредныйФакторСправки Тогда
		НовыйМассив = ОбщегоНазначенияБИТКлиентСервер.НовыйМассив(Новый ПараметрВыбора("Отбор.Родитель", Справочники.ПриказыМедосмотров.СправкиИИныеМедосмотры));
		Элементы.Приказ.ПараметрыВыбора = Новый ФиксированныйМассив(НовыйМассив);
		ПриказыСправок = ПолучитьПриказыСправок();
		Если ПриказыСправок.Количество() = 1 Тогда
			Объект.Приказ = ПриказыСправок[0].Ссылка;
		КонецЕсли;
		ВредныйФакторСправки = Истина;
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Приказ = Справочники.ПриказыМедосмотров.Приказ29н;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьЭлементовПоПриказу();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ТекущийОбъект.Приказ.Предопределенный
		И Не ЗначениеЗаполнено(ТекущийОбъект.НомерПП)
	Тогда
		ТекущийОбъект.НомерПП = ТекущийОбъект.Приказ.Код;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриказПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементовПоПриказу();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьПриказыСправок()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриказыМедосмотров.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПриказыМедосмотров КАК ПриказыМедосмотров
		|ГДЕ
		|	ПриказыМедосмотров.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Справочники.ПриказыМедосмотров.СправкиИИныеМедосмотры);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементовПоПриказу()
	
	ЭтоПриказ29Нили302Н = Объект.Приказ = ПредопределенноеЗначение("Справочник.ПриказыМедосмотров.Приказ29н")
						Или Объект.Приказ = ПредопределенноеЗначение("Справочник.ПриказыМедосмотров.Приказ302н");
						
	Элементы.ВидПеречняДляМедОсмотра.Видимость = Объект.Приказ = ПредопределенноеЗначение("Справочник.ПриказыМедосмотров.Приказ302н");
	Элементы.ГруппаМедицинскиеПротивопоказания.Видимость = ЭтоПриказ29Нили302Н;
	Элементы.ПериодичностьОсмотров.Видимость = ЭтоПриказ29Нили302Н;
	Элементы.ВрачиСтрока.Видимость = ЭтоПриказ29Нили302Н;
	Элементы.ЛабораторныеИФункциональныеИсследованияСтрока.Видимость = ЭтоПриказ29Нили302Н;
	Элементы.ГруппаВредныеВещества.Видимость = ЭтоПриказ29Нили302Н;
	ГруппаСправкиИИныеМедОсмотры = ПредопределенноеЗначение("Справочник.ПриказыМедосмотров.СправкиИИныеМедосмотры");
	РодительПриказа = ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.Приказ, "Родитель");
	Элементы.ШаблонОсмотраСправки.Видимость = ?(ЗначениеЗаполнено(Объект.Приказ), РодительПриказа = ГруппаСправкиИИныеМедОсмотры, Ложь);
	Элементы.ЛабораторныеИФункциональныеИсследованияНеТребуетОтметкиВыполнения.Видимость = ?(ЗначениеЗаполнено(Объект.Приказ), РодительПриказа = ГруппаСправкиИИныеМедОсмотры, Ложь);
	Элементы.ЛабораторныеИФункциональныеИсследованияНеУчитыватьПриРасчетеЦены.Видимость = ?(ЗначениеЗаполнено(Объект.Приказ), РодительПриказа = ГруппаСправкиИИныеМедОсмотры, Ложь);
	Элементы.ВрачиНеУчитыватьПриРасчетеЦены.Видимость = ?(ЗначениеЗаполнено(Объект.Приказ), РодительПриказа = ГруппаСправкиИИныеМедОсмотры, Ложь);
	Элементы.ВрачиНеТребуетОтметкиВыполнения.Видимость = ?(ЗначениеЗаполнено(Объект.Приказ), РодительПриказа = ГруппаСправкиИИныеМедОсмотры, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ВредныйФакторСправки Тогда
		Оповестить("ЗаписанВредныйФакторПриВызовеИзНоменклатуры", Объект.Ссылка, ЭтаФорма.ВладелецФормы.УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
